In [1]:
#call library
import numpy as np
import pandas as pd

In [2]:
#Series : inbuilt function of pandas
#to create a 1D array
a=pd.Series([10,20,30,40,50])

In [3]:
print(a)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
#Access data from series
#access 2nd element
a[2]

30

In [5]:
#Reterive the first 3 elements
print(a[:3]) #use slicing [start position:stop position]
#here not mension start position means by default

0    10
1    20
2    30
dtype: int64

In [6]:
#Retrieve the last three element
print(a[-3:]) #start=-3 stop : till end step =+1
#-3 then -3+1=-2 -2+1=1

2    30
3    40
4    50
dtype: int64

In [7]:
a=pd.Series([10,20,30,40,50],index=['A','B','C','D','F'])

In [8]:
print(a)

A    10
B    20
C    30
D    40
F    50
dtype: int64

In [9]:
#Reteriveve a single element at Loaction D
a['D']

40

In [10]:
#Reterieve multiple elements means Ath,Cth and Fth Loaction
a[['A','C','F']]  #2D except [[]]

A    10
C    30
F    50
dtype: int64

In [11]:
#2. DataFrame : to create a 2D (Two dimensional array) means to create a
# table means to hold data in the form of rows and columns

In [12]:
import pandas as pd
import numpy as np

In [13]:
# create dictionary of python
#Dictionary : key:value key combination means column name {}
d={"name":["Ram","Mohan","Govind","Suresh","Neena"],"marks":[50,60,45,75,89]
  ,"City":["Mumbai","Indore","Mumbai","Pune","Indore"]}

In [14]:
print(d)

{'name': ['Ram', 'Mohan', 'Govind', 'Suresh', 'Neena'], 'marks': [50, 60, 45, 75, 89], 'City': ['Mumbai', 'Indore', 'Mumbai', 'Pune', 'Indore']}

In [15]:
# convert this dictionary to dataframe
df=pd.DataFrame(d)  #df user defined dataframe

In [16]:
print(df)

     name  marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai
3  Suresh     75    Pune
4   Neena     89  Indore

In [17]:
#retrieve first 3 record
#head() inbuilt function of pandas
#head() : to display first 5 record from top
df.head(3)

     name  marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai

In [18]:
#tail() : to display Last 5 records
#retrieve Last 2 records
df.tail(2)

     name  marks    City
3  Suresh     75    Pune
4   Neena     89  Indore

In [19]:
#access only 3rd record then use indexing
df.iloc[3]  #iloc==> index location means location of row

name     Suresh
marks        75
City       Pune
Name: 3, dtype: object

In [20]:
#access name of all students
df["name"]

0       Ram
1     Mohan
2    Govind
3    Suresh
4     Neena
Name: name, dtype: object

In [21]:
df.name

0       Ram
1     Mohan
2    Govind
3    Suresh
4     Neena
Name: name, dtype: object

In [22]:
#retrieve multiple column then dataframe[[]] : 2D array
#retrieve name and city of all students
df[["name","City"]]

     name    City
0     Ram  Mumbai
1   Mohan  Indore
2  Govind  Mumbai
3  Suresh    Pune
4   Neena  Indore

In [23]:
df

     name  marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai
3  Suresh     75    Pune
4   Neena     89  Indore

In [24]:
#To retrieve particular cell's value
#cell means intersection of row and column
df.iloc[1,0]  #here 1-> row's index and 0 column's index

'Mohan'

In [25]:
df.loc[1,"name"]  #Loc : given row index and give the columname

'Mohan'

In [26]:
df["name"][1]

'Mohan'

In [27]:
#retrieve data through slicing : means range
#dataframe.iloc[rowstart:rowstop,colstart:colstop]

In [28]:
df

     name  marks    City
0     Ram     50  Mumbai
1   Mohan     60  Indore
2  Govind     45  Mumbai
3  Suresh     75    Pune
4   Neena     89  Indore

In [29]:
#Retrieve all details(columns) of 1st and 2nd student
df.iloc[1:3,]

     name  marks    City
1   Mohan     60  Indore
2  Govind     45  Mumbai

In [30]:
#retrieve only marks and city of 1st and 2nd student
df.iloc[1:3,1:]  #1:tillend

   marks    City
1     60  Indore
2     45  Mumbai

In [31]:
#retrieve name and marks of 1st to Last student
df.iloc[1:,0:2]

     name  marks
1   Mohan     60
2  Govind     45
3  Suresh     75
4   Neena     89

In [32]:
df.info()  #to display all information of dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   marks   5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [33]:
df.describe()

           marks
count   5.000000
mean   63.800000
std    18.157643
min    45.000000
25%    50.000000
50%    60.000000
75%    75.000000
max    89.000000

In [34]:
#Extracting Data from various source
# 1. clipboard : temporary memory of system

In [43]:
IPL=pd.read_clipboard() #IPL user defined dataframe
#read_clipboard() inbuilt fuction of pandas

In [44]:
IPL

Empty DataFrame
Columns: [num1=int(input("enter, the, students, name"))]
Index: []

In [37]:
IPL.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   num1=int(input("enter  0 non-null      object
 1   the                    0 non-null      object
 2   students               0 non-null      object
 3   name"))                0 non-null      object
dtypes: object(4)
memory usage: 0.0+ bytes

In [45]:
#To display column names
IPL.columns

Index(['num1=int(input("enter', 'the', 'students', 'name"))'], dtype='object')

In [46]:
#Retrieve first 5 record
IPL.head()

Empty DataFrame
Columns: [num1=int(input("enter, the, students, name"))]
Index: []

In [40]:
#Retrieve Last 5 records
IPL.tail()

Empty DataFrame
Columns: [num1=int(input("enter, the, students, name"))]
Index: []

In [47]:
#only display the value of winner column
IPL["Winner"]

KeyError: 'Winner'

In [ ]:
#only display winner team one time then use inbuilt fuction unique()
print(IPL["Winner"].unique())

In [ ]:
#how many times repeating means winner
IPL["Winner"].value_counts()

In [ ]:
#conditional filtering
#means to retrieve record according to conditions
#to display all details of those team whose winner=Mumbai Indians
IPL[IPL["Winner"]=="Mumbai Indians"]